<%-- 
    Document   : vvid
    Created on : 23 квіт 2010, 10:18:55
    Author     : AsuSV
--%>

<%@page contentType="text/html" pageEncoding="UTF-8"%>
<p align="center" ><strong>Допомога</strong></p>
    <p>Для входу в  програму Технічні умови потрібно пройти авторизацію:</p>
    <ol start="1" type="1">
      <li>Обрати РЕМ</li>
      <li>Вписати користувача</li>
      <li>Вписати пароль</li>
      <li>Натиснути кнопку «Вхід», або Enter на       клавіатурі.</li>
    </ol>
    <p align="center">  <br>
        <img width="513" height="307" src="help/image/index_clip_image002_0000.jpg"></p>
    <p align="left"><br>
      <strong>В програмі ведеться журналізація всіх дій, у  зв’язку з цим нікому не давайте особистий пароль.</strong></p>
    <p>При успішному  вході, виводиться вікно з переліком ТУ термін видачі яких порушений більш ніж  на 15 днів, та на 20 днів.</p>
    <img src="help/image/index_clip_image02_1000.JPG" width="598" height="559" />
    <p align="left">&nbsp;</p>
    <p>Авторизованому  користувачу виводиться головне вікно пограми, яке складається з головного меню  (1)  і тул-бара (2) і має такі  можливості:</p>
    <ol>
      <li>Створення  нового споживача;</li>
      <li>Вивід  списка ТУ;</li>
      <li>Журнал  змін ТУ;</li>
      <li>Формування  звітів;</li>
      <li>Довідники.</li>
    </ol>
    <p align="center"><img width="414" height="320" src="help/image/index_clip_image004_0000.jpg"></p>
    <p>Щоб вивести  список ТУ натисніть кнопку «Показати список ТУ»<br />
Список ТУ можна  сортувати по любому полю (клікнувши в шапці таблиці по назві поля), здійснювати  пошук по таких полях (номеру  звернення, прізвище, ім’я) та  редагувати записи, клікнувши на олівець навпроти запису. Пошук можна вести по  декількох полях одночасно, при цьому динамічно фільтруються ті записи які не підходять  заданому критерію. Навігація в вікні здійснюються шляхом вибору потрібної  сторінки вверху.</p>
    <ol start="1" type="1">
      <li>Навігація, активна сторінка       підсвічується темно-синім</li>
      <li>Пошук по прізвищу</li>
    </ol>
    <p align="center"><img src="help/image/index_clip_image02_2000.JPG" width="948" height="250" /></p>
    <p>Щоб додати нові ТУ,  натиснути кнопку «Новий споживач», у вікні що відкриється внести дані про  замовника, дані про об’єкт, ВТП, №Договіру, допуск, які згруповані  повідповідних вкладках. Після внесення інформації, натиснути кнопку «Зберегти».</p>
    <p align="center"><img src="help/image/index_clip_image02_5000.JPG" width="1098" height="706" /></p>
    <p>Пункт «Установчий  документ» містить в собі готові шаблони для вставки з можливістю їх  редагування. </p>
    <p><img src="help/image/index_clip_image02_6000.JPG" width="1028" height="358" />    </p>
    <p><strong>Пошук</strong></p>
    <p>Для пошуку потрібно на панелі задач натиснути пошук, в вікні задати критерії пошуку і натиснути знайти. В вікні відобразиться список споживачів що буде знайдений по даним критеріям. Для нового пошуку потрібно натиснути відповідну кноппу в цьому вікні. </p>
    <p><img src="help/image/index_clip_image02_9100.JPG" width="1595" height="317" /></p>
    <p align="center"><img src="help/image/index_clip_image02_9200.JPG" width="1600" height="649" /><img src="help/image/index_clip_image02_9300.JPG" width="1041" height="343" /></p>
    <p><strong>Звіти</strong><br>
    Формування звітів  відбувається через головне меню програми, шляхом вибору потрібного пункту:</p>
    <p align="center"><br>
      <img width="516" height="255" src="help/image/index_clip_image010_0000.jpg"></p>
    <p align="center">&nbsp;</p>
    <p><strong>Журнал змін в ТУ</strong><br>
      Для виводу  журналу, натисніть кнопку в тулбарі «Журнал змін в ТУ» </p>
    <p align="center"><img width="624" height="409" src="help/image/index_clip_image012_0000.jpg"></p>