<%@page contentType="text/html" pageEncoding="UTF-8"%>
<%@ taglib uri="http://struts.apache.org/tags-bean" prefix="bean" %>
<%@ taglib uri="http://struts.apache.org/tags-html" prefix="html" %>
<%@ taglib uri="http://struts.apache.org/tags-logic" prefix="logic" %>
<%
    response.setHeader("Cache-Control", "no-cache"); //HTTP 1.1
    response.setHeader("Pragma", "no-cache"); //HTTP 1.0
    response.setDateHeader("Expires", 0); //prevents caching at the proxy server
    String id_rem = ua.ifr.oe.tc.list.MyCoocie.getCoocie("UREM_ID", request);
%>
<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
        <title>JSP Page</title>
        <script type="text/javascript" src="detailedview/js/myscript.js"></script>
        <script type="text/javascript" src="detailedview/js/multiedit.js"></script>
        
        <script>
            $(document).ready(function(){
                permision();
                multiedit();
                $(".multi_edit_new .multiedit_mul").click(function(){
                   if ($.cookie("permisions")=="-1") {return false;};
                    $(this).next('.hide_list').toggle("blind");
                });
                $("h1").click(function(){
                    if ($.cookie("permisions")=="-1") {return false;};
                    $(this).next('.block_l1').toggle("blind");
                }).hover(function(){
                    $(this).addClass("div_hover");
                },function(){
                    $(this).removeClass("div_hover");
                });
                $('.items').hover(function(){
                    $(this).addClass("div_hover");
                },function(){
                    $(this).removeClass("div_hover");
                });
                $('.items').click(function(){
                    if ($.cookie("permisions")=="-1") {return false;};
                    var the_value = $(this).html();
                    var tmp = $(this).parent().parent().parent().parent();
                    var the_value_pre = tmp.children('.edit').val();
                    var it_n = parseInt(tmp.children('.multiedit_mul').attr("id"))+1;
                    var pr_it_n = tmp.children('.multiedit_mul').attr("pr");
                    tmp.children('.multiedit_mul').attr("id",it_n);
                    tmp.children('.edit').val(the_value_pre+pr_it_n+it_n+'  '+the_value+'\n');
                    tmp.children('.hide_list').toggle("blind");
                });
            });
        </script>
        <style type="text/css" >
            .div_hover{
                background: #DD0000;
                border: #000;
            }
            .hide_list span{
                border: #0000FF;
            }
            .block{
                border-width: 4px;
                border-style: solid;
                border-color: #00FF00;
            }
            .items{
                padding: 0px;
                margin: 0px;
                border-width: 2px;
                border-style: solid;
                border-color: #0000FF;
                font-size: 12px;
            }
            h1{
                border-width: 2px;
                border-style: solid;
                border-color: #990000
            }
        </style>
    </head>
    <body>
    <table class="rated_current_table">
        <tr>
            <td class="rated_current">Номінальний струм ввідного автомата</td>
            <td id="rated_current_machine"><html:select name="DetalViewActionForm"  property="rated_current_machine">
                <html:option value="0"></html:option>
                <html:option value="16">16</html:option>
                <html:option value="20">20</html:option>
                <html:option value="25">25</html:option>
                <html:option value="32">32</html:option>
                <html:option value="40">40</html:option>
                <html:option value="50">50</html:option>
                <html:option value="63">63</html:option>
                <html:option value="80">80</html:option>
                <html:option value="100">100</html:option>
            </html:select>
            </td>
        </tr>
    </table>
        <table>
            <%--<tr>
                <td>Джерело живлення</td>
                <td colspan="3"><html:text name="DetalViewActionForm" property="power_source"size="80" styleClass=""/></td>
</tr>--%>
            <tr>
                <td colspan="2" >Вимоги до електромереж основного та резервного живлення в мережах ЕО:</td>
            </tr>
            <tr>
                <td colspan="2" >
                    <div class="multi_edit_new">
                        <html:textarea name="DetalViewActionForm" property="do1" cols="100" rows="10" styleClass="edit dataobjects"/>
                        <img src="../codebase/imgs/edit3.bmp" class="multiedit_mul" id="0" pr="7.1." />
                        <div  class="hide_list" style="background-color: #ffffff;display:none" >
                            <div class="block">
                                <h1>«Розробник ТУ» - РЕМ</h1>
                                <div class="block_l1" style="display: none">
                                    <div class="items" >виконати монтаж  проводу типу СІП- від опори №  до ввідного пристрою 0,4 кВ житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом.</div>
                                    <div class="items" >побудувати ЛЕП-0,23 кВ на з/б опорах  проводом типу СІП  від опори № до ввідного пристрою 0,23 кВ  житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом</div>
                                    <div class="items" >виконати монтаж  проводу типу СІП- від РП-0,4 кВ приміщення № , що живиться по  Л- ТП- до ввідного пристрою 0, кВ  житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,___ кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,4 кВ на з/б опорах проводом типу СІП-  від РП-0,4 кВ ТП- до ввідного пристрою 0,4 кВ житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,23 кВ на з/б опорах проводом типу СІП-  від РП-0,4 кВ ТП- до ввідного пристрою 0,23 кВ житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом</div>
                                    <div class="items" >провести реконструкцію ЛЕП-0,4 кВ із заміною існуючого проводу типу А- на провід типу А- між опорами № №  ПЛ-0,4 кВ Л- від ТП- . Необхідну реконструкцію ЛЕП-0,4 Л- від ТП- пов’язану із заміною проводу визначити проектом.</div>
                                    <div class="items" >провести заміну існуючого автомата 0,4 кВ Л-___ на ТП-_____ з ___ А на ____ А. Тип автомата 0,4 кВ визначити проектом.</div>
                                    <div class="items" >провести монтаж додаткового проводу між опорами № № ПЛ-0,4 кВ  Л- від ТП- . Тип та перетин проводу визначити проектом.</div>
                                    <div class="items" >в РП -0,4 кВ ТП- встановити додатковий автомат 0,4 кВ. Тип автомата 0,4 кВ визначити проектом.</div>
                                    <div class="items" >в РП -0,4 кВ ТП- встановити додаткову панель типу ЩО-99.</div>
                                    <div class="items" >- ЛЕП-0,4 кВ від РП-0,4 кВ до проектної опори 0,4 кВ. Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом.</div>
                                    <div class="items" >- ЛЕП-0,23 кВ від РП-0,4 кВ до проектної опори 0,4 кВ. Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом.</div>
                                    <div class="items" >- ЛЕП-0,4 кВ від опори №   до проектної опори 0,4 кВ. Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом.</div>
                                    <div class="items" >- ЛЕП-0,23 кВ від опори №   до проектної опори 0,4 кВ. Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом.</div>

                                </div>
                            </div>

                            <div class="block">
                                <h1>«Розробник ТУ» - ВТП</h1>
                                <div class="block_l1" style="display: none">
                                    <div class="items" >побудувати закриті двотрансформаторні підстанції 10 (6)/0,4 кВ блочного типу. Кількість трансформаторних підстанцій, місце їх розташування, тип силових трансформаторів, їх потужність та інші технічні параметри визначити проектом</div>
                                    <div class="items" >побудувати закриту двохтрансформаторну підстанцію 10 (6)/0,4 кВ блочного типу. Кількість трансформаторних підстанцій, місце їх розташування, тип силових трансформаторів, їх потужність та інші технічні параметри визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-10 кВ необхідного перетину з різних секцій шин РП-10 кВ ПС  кВ «» до РП-10 кВ проектних ТП. Кількість, тип, перетин та трасу проходження ЛЕП-10 кВ визначити проектом</div>
                                    <div class="items" >виконати перезавід існуючої ЛЕП-10 кВ приєднання «» з комірки №  на першій секції шин 10 кВ в одну з лінійних комірок 10 кВ на другій секції шин 10 кВ ПС  кВ «». Необхідну реконструкцію пов’язану з перезаводом визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-10 кВ необхідного перетину від РП-10 кВ ТП- до РП-10 кВ проектного ТП. Тип, перетин та трасу проходження ЛЕП-10 кВ визначити проектом</div>
                                    <div class="items" >на ПС  кВ «» замінити силовий трансформатор Т- потужністю  мВА на силовий трансформатор потужністю  мВА. Тип силового трансформатора та необхідну реконструкцію пов’язану з його заміною визначити проектом</div>
                                    <div class="items" >в комірці вводу 10 кВ силового трансформатора Т- ПС  кВ «» виконати заміну масляного вимикача 10 кВ на вакуумний вимикач 10 кВ. Тип вимикача та необхідну реконструкцію пов’язану з його заміною визначити проектом</div>
                                    <div class="items" >побудувати дві ЛЕП-10 кВ необхідного перетину врізкою в існуючу ЛЕП-10 кВ «» до РП-10 кВ проектної ТП. Тип, перетин, місце підключення та трасу проходження ЛЕП-10 кВ визначити проектом</div>
                                    <div class="items" >встановити на першій секції шин 0,4 кВ ТП -  лінійну панель 0,4 кВ типу ЩО-99. Необхідну реконструкцію пов’язану із її встановленням визначити проектом</div>
                                    <div class="items" >встановити в РП-0,4 кВ ТП -  комутаційний апарат типу РПС-250 з запобіжниками типу ПН-2. Необхідну реконструкцію пов’язану з встановленням визначити проектом</div>
                                    <div class="items" >виконати заміну існуючих збірних шин 10 кВ в РП-10 кВ та шинних мостів 10 кВ Т-1 та Т-2 ПС  кВ «» на збірні шини та шинні мости більшого перетину. Перетин шинних мостів, збірних шин 10 кВ та необхідну реконструкцію пов’язану з їх заміною визначити проектом</div>
                                    <div class="items" >в ТП –  виконати заміну існуючих шинних мостів 10-0,4 кВ та ввідного рубильника 0,4 кВ силового трансформатора Т- на шинні мости 10-0,4 кВ більшого перетину та ввідний рубильник з більшим номінальним струмом. Перетин шинних мостів та тип ввідного рубильника визначити проектом</div>
                                    <div class="items" >виконати добудову будівельної частини ТП -  з метою встановлення другого силового трансформатора 10/0,4 кВ необхідної потужності, з влаштуванням другої секції шин 10 кВ (комірки типу КСО-393) та другої секції шин 0,4 кВ (ввідні блок-рубильники з запобіжниками типу ARS). Тип та потужність силового трансформатора визначити проектом</div>
                                    <div class="items" >встановити  в РП-0,4 кВ ТП необхідну кількість ввідних блок-рубильників з запобіжниками типу ARS </div>
                                    <div class="items" >на різних секціях шин 0,4 кВ ТП- панелі розподільчих шаф типу РШНН з вимикачами-роз’єднувачами із запобіжниками типу ARS. Необхідну реконструкцію РП-0,4 кВ пов’язану із встановленням панелей визначити проектом</div>
                                    <div class="items" >виконати заміну низьковольтних перекидок від РП-0,4 кВ ТП- до першої опори Л- проводом типу АПВ-</div>
                                    <div class="items" >побудувати ЛЕП-0,4 кВ необхідного перетину з ВРП-0,4 кВ будинку №  по вул. до ВРП-0,4 кВ приміщення. Тип, трасу, переріз, ЛЕП-0,4 кВ визначити проектом</div>
                                    <div class="items" >для приєднання проектної ЛЕП-0,4 кВ необхідно встановити у ВРП-0,4 кВ будинку №  по вул.  додатковий автоматичний вимикач 0,4 кВ. Тип вимикача та можливість підключення у ВРП-0,4 кВ визначити проектом та погодити з власником ВРП-0,4 кВ</div>
                                    <div class="items" >встановити в РП-0,4 кВ ТП-  лінійну розподільчу панель 0,4 кВ типу ЩО- з фарфоровою ізоляцією та шинним мостом</div>
                                    <div class="items" >встановити в РП- 10(6) кВ ТП-  лінійну коміку 10(6) кВ типу КСО-  з вимикачем навантаження 10(6) кВ. Тип вимикача визначити проектом</div>
                                    <div class="items" >в РП-0,4 кВ ТП-  замінити лінійну розподільчу панель 0,4 кВ .Тип лінійної комірки 0,4 кВ та кількість приєднань визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,4 кВ сумісним підвішуванням проводу від РП-0,4 кВ ТП- до опори № . Тип та перетин проводу ЛЕП-0,4 кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,23 кВ сумісним підвішуванням проводу від РП-0,4 кВ ТП- до опори № . Тип та перетин проводу ЛЕП-0,23 кВ визначити проектом</div>
                                    <div class="items" >між опорами № № замінити існуючий провід типу А - на провід типу . Необхідну реконструкцію ЛЕП-0,4 кВ Л- від ТП- пов’язану із заміною проводу визначити проектом</div>
                                    <div class="items" >ЛЕП-10 кВ необхідного перетину від опори №  ПЛЕП-10 кВ приєднання « » до проектної ТП. Тип, перетин та трасу проходження ЛЕП-10 кВ визначити проектом. В місці відгалуження встановити лінійний роз’єднувач ____ кВ. Тип лінійного роз’єднувача ___ кВ визначити проектом</div>
                                    <div class="items" >ЛЕП-6 кВ необхідного перетину від опори №  ПЛЕП-6кВ приєднання « » до проектної ТП. Тип, перетин та трасу проходження ЛЕП-6 кВ визначити проектом. В місці відгалуження встановити лінійний роз’єднувач ____ кВ. Тип лінійного роз’єднувача ___ кВ визначити проектом</div>
                                    <div class="items" >ЛЕП- кВ необхідного перетину від РП- кВ ПС  кВ « » до проектної ТП. Тип, перетин та трасу проходження ЛЕП- кВ визначити проектом</div>
                                    <div class="items" >трансформаторну підстанцію 10/0,4 кВ з силовим трансформатором необхідної потужності. Тип, потужність силового трансформатора та місце установки ТП визначити проектом</div>
                                    <div class="items" >трансформаторну підстанцію 6/0,4 кВ з силовим трансформатором необхідної потужності. Тип, потужність силового трансформатора та місце установки ТП визначити проектом</div>
                                    <div class="items" >побудувати двохтрансформаторну підстанцію закритого типу (секціонування шин 10-0,4 кВ, шатровий дах, металеві двері) з встановленням: 1) в РП-10 кВ проектної ТП лінійних комірок 10 кВ типу КЗО-393; 2) в РП-0,4 кВ проектної ТП лінійної розподільчої панелі 0,4 кВ серії ЩО-99 з фарфоровою ізоляцією та шинним мостом необхідного перетину  для приєднання проектних КЛ-0,4 кВ; Тип, потужність силових трансформаторів та кількість лінійних комірок 10-0,4 кВ визначити проектом</div>
                                    <div class="items" >побудувати двохтрансформаторну підстанцію закритого типу (секціонування шин 6-0,4 кВ, шатровий дах, металеві двері) з встановленням: 1) в РП-6 кВ проектної ТП лінійних комірок 6 кВ типу КЗО-393; 2) в РП-0,4 кВ проектної ТП лінійної розподільчої панелі 0,4 кВ серії ЩО-99 з фарфоровою ізоляцією та шинним мостом необхідного перетину  для приєднання проектних КЛ-0,4 кВ; Тип, потужність силових трансформаторів та кількість лінійних комірок 10-0,4 кВ визначити проектом</div>
                                    <div class="items" >в ТП- встановити силовий трансформатор необхідної потужності взамін існуючого силового трансформатора потужністю  кВА. Тип, потужність силового трансформатора та необхідну реконструкцію ТП-____ пов’язану із заміною силового трансформатора визначити проектом</div>
                                    <div class="items" >в РП-10 кВ ПС кВ «» на приєднанні «» виконати заміну існуючого масляного вимикача 10 кВ на вакуумний вимикач 10 кВ. Тип вакуумного вимикача 10 кВ визначити проектом</div>
                                    <div class="items" >в РП-6 кВ ПС кВ «» на приєднанні «» виконати заміну існуючого масляного вимикача 6 кВ на вакуумний вимикач 6 кВ. Тип вакуумного вимикача 6 кВ визначити проектом</div>
                                    <div class="items" >в РП-10 кВ ПС кВ « » встановити лінійну комірку 10 кВ з вакуумним вимикачем 10 кВ для підключення проектної ЛЕП-10 кВ. Тип комірки 10 кВ та вакуумного вимикача 10 кВ визначити проектом</div>
                                    <div class="items" >в РП-6 кВ ПС кВ « » встановити лінійну комірку 6 кВ з вакуумним вимикачем 6 кВ для підключення проектної ЛЕП-6 кВ. Тип комірки 6 кВ та вакуумного вимикача 6 кВ визначити проектом</div>
                                    <div class="items" >відгалуження 0,4 кВ від опори №  до ВРЩ-0,4 кВ . Тип, перетин та трасу проходження відгалуження визначити проектом.</div>
                                    <div class="items" >відгалуження 0,23 кВ від опори №  до ВРЩ-0,23 кВ . Тип, перетин та трасу проходження відгалуження визначити проектом.</div>
                                    <div class="items" >відгалуження 0,4 кВ необхідного перетину від кронштейна №  до ВРЩ-0,4 кВ . Тип, перетин та трасу проходження відгалуження визначити проектом.</div>
                                    <div class="items" >відгалуження 0,23 кВ необхідного перетину від кронштейна №  до ВРЩ-0,23 кВ . Тип, перетин та трасу проходження відгалуження визначити проектом.</div>
                                    <div class="items" >побудувати ЛЕП-0,4 кВ необхідного перетину від РП-0,4 кВ ТП- до ВРЩ-0,4 кВ . Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом.</div>
                                    <div class="items" >побудувати ЛЕП-0,23 кВ необхідного перетину від РП-0,4 кВ ТП- до ВРЩ-0,23 кВ . Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом.</div>
                                    <div class="items" >в РП-0,4 кВ ТП-___ встановити додатковий автоматичний вимикач 0,4 кВ для підключення проектної ЛЕП-0,4 кВ. Тип автоматичного вимикача 0,4 кВ визначити проектом.</div>
                                    <div class="items" >в РП-0,4 кВ ТП-___ встановити додатковий автоматичний вимикач 0,23 кВ для підключення проектної ЛЕП-0,23 кВ. Тип автоматичного вимикача 0,23 кВ визначити проектом.</div>
                                    <div class="items" >ЛЕП-0,4 кВ від різних секцій шин РП-0,4 кВ ТП- до ВРЩ-0,4 кВ . Тип, перетин, кількість та трасу проходження ЛЕП-0,4 кВ визначити проектом.</div>
                                    <div class="items" >встановити ВРП-0,4 кВ з секціонуванням шин, комутаційними апаратами  захисту від струмів короткого замикання і від перевантажень в проектному будинку. Тип, марку, кількість, місце встановлення ВРП-0,4 кВ визначити проектом.</div>
                                    <div class="items" >встановити в ТП- другий силовий трансформатор 10(6)/0,4 кВ необхідної потужності. Тип, потужність силового трансформатора визначити проектом</div>
                                    <div class="items" >в РП-0,4 кВ ЗТП- встановити рубильник вводу. Тип рубильника визначити проектом.</div>
                                    <div class="items" >в РП-10 кВ ТП- встановити комірку 10 кВ з секційним вимикачем. Тип комірки 10 кВ та секційного вимикача 10 кВ визначити проектом.</div>
                                    <div class="items" >в РП-6 кВ ТП- встановити комірку 6 кВ з секційним вимикачем. Тип комірки 6 кВ та секційного вимикача 6 кВ визначити проектом.</div>

                                </div>
                            </div>
                        </div>
                    </div>
                </td>
            </tr>
            <tr>
                <td colspan="2" >Вимоги до електричних мереж основного живлення замовника:</td>
            </tr><tr>
                <td colspan="2">
                    <div class="multi_edit_new">
                        <html:textarea name="DetalViewActionForm" property="do2" cols="100" rows="10" styleClass="edit dataobjects"/>
                        <img src="../codebase/imgs/edit3.bmp" class="multiedit_mul" id="0" pr="7.2." />
                        <div  class="hide_list" style="display:none" >
                            <div class="block">
                                <h1>«Розробник ТУ» - РЕМ</h1>
                                <div class="block_l1" style="display: none">
                                    <div class="items" >провести реконструкцію ЛЕП-0,4 кВ із заміною існуючого проводу типу А- на провід типу А- між опорами № №  ПЛ-0,4 кВ Л- від ТП- . Необхідну реконструкцію ЛЕП-0,4 Л- від ТП- пов’язану із заміною проводу визначити проектом.</div>
                                    <div class="items" >провести заміну існуючого автомата 0,4 кВ Л-___ на ТП- з ___ А на ____ А. Тип автомата 0,4 кВ визначити проектом.</div>
                                    <div class="items" >провести монтаж додаткового проводу між опорами № № ПЛ-0,4 кВ  Л- від ТП- . Тип та перетин проводу визначити проектом.</div>
                                    <div class="items" >в РП -0,4 кВ ТП  встановити додатковий автомат 0,4 кВ. Тип автомата 0,4 кВ визначити проектом.</div>
                                    <div class="items" >в РП -0,4 кВ ТП _____ встановити додатковий автомат 0,23 кВ. Тип автомата 0,23 кВ визначити проектом.</div>
                                    <div class="items" >в РП -0,4 кВ ТП  встановити додаткову панель типу ЩО-99.</div>

                                    <div class="items" >виконати монтаж  проводу типу СІП- від опори №  до ввідного пристрою 0,4 кВ житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом.</div>
                                    <div class="items" >виконати монтаж  проводу типу СІП- від опори №  до ввідного пристрою 0,23 кВ житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом.</div>
                                    <div class="items" >виконати монтаж  проводу типу СІП- від РП-0,4 кВ приміщення № ,  що живиться по  Л- ТП- до ввідного пристрою 0,4 кВ  житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,4 кВ на з/б опорах проводом типу СІП  від РП-0,4 кВ ТП- до ввідного пристрою 0,4 кВ житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,23 кВ на з/б опорах проводом типу СІП  від РП-0,4 кВ ТП- до ввідного пристрою 0,23 кВ житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,4 кВ на з/б опорах  проводом типу СІП  від опори № до ввідного пристрою 0,4 кВ житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,23 кВ на з/б опорах  проводом типу СІП  від опори № до ввідного пристрою 0,23 кВ житлового будинку. Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом</div>
                                </div>
                            </div>
                            <div class="block">
                                <h1>«Розробник ТУ» - ВТП</h1>
                                <div class="block_l1" style="display: none">
                                    <div class="items" >забезпечити дотримання вимог п.5.7 ДСТУ 7092:2009, п.6.2 та п.10 ДСТУ IEC/TR 61000-2-1:2007 в частині забезпечення електромагнітної сумісності мереж</div>
                                    <div class="items" >внутрішньобудинкові мережі приміщень прокласти з відокремленням споживачів першої категорії електропостачання від існуючих електромереж та прокласти окремі КЛ-0,4 кВ від автономного джерела живлення до ВРЩ-0,4 кВ цих об’єктів. Тип, кількість та перетин  резервних КЛ-0,4 кВ з урахуванням загального навантаження на кожну КЛ визначити проектом</div>
                                    <div class="items" >відгалуження 0,4 кВ від опори №  до ВРЩ-0,4 кВ . Тип, перетин та трасу проходження відгалуження визначити проектом.</div>
                                    <div class="items" >відгалуження 0,23 кВ від опори №  до ВРЩ-0,23 кВ . Тип, перетин та трасу проходження відгалуження визначити проектом.</div>
                                    <div class="items" >відгалуження 0,4 кВ необхідного перетину від кронштейна №  до ВРЩ-0,4 кВ . Тип, перетин та трасу проходження відгалуження визначити проектом.</div>
                                    <div class="items" >відгалуження 0,23 кВ необхідного перетину від кронштейна №  до ВРЩ-0,23 кВ . Тип, перетин та трасу проходження відгалуження визначити проектом.</div>
                                    <div class="items" >побудувати ЛЕП-0,4 кВ необхідного перетину від РП-0,4 кВ ТП- до ВРЩ-0,4 кВ . Тип, перетин та трасу проходження ЛЕП-0,4 кВ визначити проектом.</div>
                                    <div class="items" >побудувати КЛ-0,4 кВ необхідного перетину від РП-0,4 кВ ТП- до ВРЩ-0,4 кВ . Тип, перетин та трасу проходження КЛ-0,4 кВ визначити проектом.</div>
                                    <div class="items" >побудувати ЛЕП-0,23 кВ необхідного перетину від РП-0,4 кВ ТП- до ВРЩ-0,23 кВ . Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом.</div>
                                    <div class="items" >в РП-0,4 кВ ТП-___ встановити додатковий автоматичний вимикач 0,4 кВ для підключення проектної ЛЕП-0,4 кВ. Тип автоматичного вимикача 0,4 кВ визначити проектом.</div>
                                    <div class="items" >в РП-0,4 кВ ТП-___ встановити додатковий автоматичний вимикач 0,23 кВ для підключення проектної ЛЕП-0,23 кВ. Тип автоматичного вимикача 0,23 кВ визначити проектом.</div>
                                    <div class="items" >ЛЕП-0,4 кВ від різних секцій шин РП-0,4 кВ ТП- до ВРЩ-0,4 кВ . Тип, перетин, кількість та трасу проходження ЛЕП-0,4 кВ визначити проектом.</div>
                                    <div class="items" >КЛ-0,4 кВ від різних секцій шин РП-0,4 кВ ТП- до ВРЩ-0,4 кВ . Тип, перетин, кількість та трасу проходження КЛ-0,4 кВ визначити проектом.</div>
                                    <div class="items" >встановити ВРП-0,4 кВ з секціонуванням шин, комутаційними апаратами  захисту від струмів короткого замикання і від перевантажень в проектному будинку. Тип, марку, кількість, місце встановлення ВРП-0,4 кВ визначити проектом.</div>

                                    <div class="items" >побудувати ЛЕП-0,4 кВ сумісним підвішуванням проводу від РП-0,4 кВ ТП- до опори № . Тип та перетин проводу ЛЕП-0,4 кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,23 кВ сумісним підвішуванням проводу від РП-0,4 кВ ТП- до опори № . Тип та перетин проводу ЛЕП-0,23 кВ визначити проектом</div>
                                    <div class="items" >між опорами № № замінити існуючий провід типу А - на провід типу . Необхідну реконструкцію ЛЕП-0,4 Л- від ТП- пов’язану із заміною проводу визначити проектом</div>
                                    <div class="items" >ЛЕП-10 кВ необхідного перетину від опори №  ПЛЕП-10 кВ приєднання «» до проектної ТП. Тип, перетин та трасу проходження ЛЕП-10 кВ визначити проектом. В місці відгалуження встановити лінійний роз’єднувач 10 кВ. Тип лінійного роз’єднувача 10 кВ визначити проектом</div>
                                    <div class="items" >ЛЕП-6 кВ необхідного перетину від опори №  ПЛЕП-6 кВ приєднання «» до проектної ТП. Тип, перетин та трасу проходження ЛЕП-6 кВ визначити проектом. В місці відгалуження встановити лінійний роз’єднувач 6 кВ. Тип лінійного роз’єднувача 6 кВ визначити проектом</div>
                                    <div class="items" >ЛЕП-10 кВ необхідного перетину від РП-10 кВ ПС  кВ «» до проектної ТП. Тип, перетин та трасу проходження ЛЕП-10 кВ визначити проектом</div>
                                    <div class="items" >ЛЕП-6 кВ необхідного перетину від РП-6 кВ ПС  кВ «» до проектної ТП. Тип, перетин та трасу проходження ЛЕП-6 кВ визначити проектом</div>
                                    <div class="items" >трансформаторну підстанцію 10/0,4 кВ з силовим трансформатором необхідної потужності. Тип, потужність силового трансформатора та місце установки ТП визначити проектом</div>
                                    <div class="items" >трансформаторну підстанцію 6/0,4 кВ з силовим трансформатором необхідної потужності. Тип, потужність силового трансформатора та місце установки ТП визначити проектом</div>
                                    <div class="items" >побудувати двохтрансформаторну підстанцію закритого типу (секціонування шин 10-0,4 кВ, шатровий дах, металеві двері) з встановленням: 1) в РП-10 кВ проектної ТП лінійних комірок 10 кВ типу КЗО-393; 2) в РП-0,4 кВ проектної ТП лінійної розподільчої панелі 0,4 кВ серії ЩО-99 з фарфоровою ізоляцією та шинним мостом необхідного перетину  для приєднання проектних КЛ-0,4 кВ; Тип, потужність силових трансформаторів та кількість лінійних комірок 10-0,4 кВ визначити проектом</div>
                                    <div class="items" >побудувати двохтрансформаторну підстанцію закритого типу (секціонування шин 6-0,4 кВ, шатровий дах, металеві двері) з встановленням: 1) в РП-6 кВ проектної ТП лінійних комірок 10 кВ типу КЗО-393; 2) в РП-0,4 кВ проектної ТП лінійної розподільчої панелі 0,4 кВ серії ЩО-99 з фарфоровою ізоляцією та шинним мостом необхідного перетину  для приєднання проектних КЛ-0,4 кВ; Тип, потужність силових трансформаторів та кількість лінійних комірок 10-0,4 кВ визначити проектом</div>
                                    <div class="items" >в ТП- встановити силовий трансформатор необхідної потужності взамін існуючого силового трансформатора потужністю  кВА. Тип, потужність силового трансформатора та необхідну реконструкцію ТП-____ пов’язану із заміною силового трансформатора визначити проектом</div>
                                    <div class="items" >в РП-10 кВ ПС кВ « » на приєднанні « » виконати заміну існуючого масляного вимикача 10 кВ на вакуумний вимикач 10 кВ. Тип вакуумного вимикача 10 кВ визначити проектом</div>
                                    <div class="items" >в РП-6 кВ ПС кВ « » на приєднанні « » виконати заміну існуючого масляного вимикача 6 кВ на вакуумний вимикач 6 кВ. Тип вакуумного вимикача 6 кВ визначити проектом</div>
                                    <div class="items" >в РП-10 кВ ПС  кВ « » встановити лінійну комірку 10 кВ з вакуумним вимикачем 10 кВ для підключення проектної ЛЕП-10 кВ. Тип комірки 10 кВ та вакуумного вимикача 10 кВ визначити проектом</div>
                                    <div class="items" >в РП-6 кВ ПС  кВ « » встановити лінійну комірку 6 кВ з вакуумним вимикачем 6 кВ для підключення проектної ЛЕП-6 кВ. Тип комірки 6 кВ та вакуумного вимикача 6 кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,4 кВ необхідного перетину від РП-0,4 кВ ТП- по магістралі вулиці. Тип, перетин та трасу проходження ЛЕП-0, кВ визначити проектом</div>
                                    <div class="items" >побудувати ЛЕП-0,23 кВ необхідного перетину від РП-0,4 кВ ТП- по магістралі вулиці. Тип, перетин та трасу проходження ЛЕП-0,23 кВ визначити проектом</div>
                                </div>
                            </div>
                        </div>
                    </div>
                </td>
            </tr>
            <tr>
                <td colspan="2">Вимоги до розрахункового обліку електричної енергії:<br/>
                    <div class="multi_edit_new">
                        <html:textarea name="DetalViewActionForm" cols="100" property="do3" styleClass="edit dataobjects"/>
                        <img src="../codebase/imgs/edit3.bmp" class="multiedit_mul" id="0" pr="7.2." />
                        <div  class="hide_list" style="display:none" >
                            <div class="block">
                                <h1>«Розробник ТУ» - РЕМ</h1>
                                <div class="block_l1">
                                    <div class="items">Встановити однотарифний прилад обліку електроенергії з функцією обмеження максимуму споживання потужності.</div>
                                    <div class="items">Встановити двотарифний прилад обліку електроенергії з функцією обмеження максимуму споживання потужності.</div>
                                    <div class="items">Без обліку згідно   дозволеної  потужності.</div>
                                </div>
                            </div>
                            <div class="block">
                                <h1>«Розробник ТУ» - ВТП</h1>
                                <div class="block_l1">
                                    <div class="items">Встановити трифазний лічильник електроенергії трансформаторного включення, тип лічильника та коефіцієнт трансформації трансформаторів струму погодити з РЕМ</div>
                                    <div class="items">Передбачити облаштування обліку електричної енергії житлових і нежитлових приміщень, загальнобудинкового обліку та обліку технічних цілей будинку лічильниками електричної енергії електронного типу з функцією обмеження максимуму споживання електричної потужності та можливістю передачі інформації. Тип та марку засобів обліку визначити проектом.</div>
                                    <div class="items">Встановити однотарифний прилад обліку електроенергії з функцією обмеження максимуму споживання потужності.</div>
                                    <div class="items">Встановити двотарифний прилад обліку електроенергії з функцією обмеження максимуму споживання потужності.</div>
                                    <div class="items">Для організації комерційного обліку встановити засоби ЛУЗОД згідно ТЗ № , виданих службою приладів обліку ПАТ “Прикарпаттяобленерго”. Місце влаштування обліку та робочий проект на електропостачання підприємства погодити в СПО ПАТ “Прикарпаттяобленерго”.</div>
                                    <div class="items">Встановити трифазний лічильник електроенергії, тип лічильника погодити з РЕМ</div>
                                    <div class="items">Для житлових приміщень придбання, встановлення та підключення приладів обліку електричної енергії виконується РЕМ за рахунок абонента згідно вимог п.8 ПКЕЕН. Встановити прилади обліку електроенергії з функцією обмеження максимуму споживання потужності</div>
                                    <div class="items">Для не житлових приміщень встановити прилади обліку електроенергії з функцією обмеження максимуму споживання потужності</div>
                                    <div class="items">На межі балансової належності встановити загальнобудинковий розрахунковий облік</div>
                                    <div class="items">Без обліку згідно   дозволеної  потужності.</div>
                                </div>
                            </div>
                        </div>
                    </div>
                </td>
            </tr>
            <tr>
                <td colspan="2">Вимоги до технічного узгодження електроустановок Замовника та електропередавальної організації:<br>
                    <html:textarea name="DetalViewActionForm" property="do9" cols="100" rows="10"  styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td colspan="2">Вимоги до електропостачання приладів та пристроїв, які використовуються для будівництва та реконструкції об’єктів електромереж<br>
                    <html:textarea name="DetalViewActionForm" property="do10" cols="100" rows="10" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td colspan="2">Вимоги до електромереж резервного живлення, в тому числі виділення відповідного електрообладнання на окремі резервні лінії живлення для збереження електропостачання цього електрообладнання у разі виникнення дефіциту потужності в об’єднаній енергосистемі:<br/>
                    <div class="multi_edit">
                        <html:textarea name="DetalViewActionForm" cols="100" property="do4" styleClass="edit dataobjects"/>
                        <img src="../codebase/imgs/edit3.bmp" class="multiedit"/>
                        <div  class="hide_list" style="display:none" >
                            <input type="radio" /><span>для споживачів першої категорії електропостачання передбачити автономне джерело живлення необхідної потужності. Тип автономного джерела живлення визначити проектом.</span><br/>
                        </div>
                    </div>
                </td>
            </tr>
            <tr>
                <td colspan="2">Вимоги до ізоляції, захисту від перенапруги:<br/>
                    <div class="multi_edit">
                        <html:textarea name="DetalViewActionForm" cols="100" property="do11" styleClass="edit dataobjects"/>
                        <img src="../codebase/imgs/edit3.bmp" class="multiedit"/>
                        <div  class="hide_list" style="display:none" >
                            <input type="radio" /><span>Встановити прилад з функцією обмеження потужності типу (у трифазному виконанні ПЗР 2-3- А).</span><br/>
                            <input type="radio" /><span>Встановити прилад з функцією обмеження потужності типу (у однофазному виконанні ПЗР 2-3- А).</span><br/>
                        </div>
                    </div>
                </td>
            </tr>
            <tr>
                <td>Додаткові технічні умови приєднання будівельних струмоприймачів, у разі необхідності, одержати: </td>
                <td><html:text name="DetalViewActionForm" property="do13" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Рекомендації щодо використання типових проектів електрозабезпечення електроустановок: </td>
                <td><html:text name="DetalViewActionForm" property="do14" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Рекомендації щодо регулювання добового графіка навантаження:</td>
                <td><html:text name="DetalViewActionForm" property="do15" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Встановлення засобів вимірювальної техніки для контролю якості електричної енергії: </td>
                <td><html:text name="DetalViewActionForm" property="do16" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Вимоги до компенсації реактивної потужності:</td>
                <td><html:text name="DetalViewActionForm" property="do17" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Влаштування захисту від пошкоджень та обмеження дозволеної потужності:</td>
                <td><html:text name="DetalViewActionForm" property="do5" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Вимоги до релейного захисту й автоматики, захисту від коротких замикань та перевантажень, компенсації струмів однофазного замикання в мережах з ізольованою шиною нейтралі тощо:</td>
                <td><html:text name="DetalViewActionForm" property="do6" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Вимоги до телемеханіки та зв’язку:</td>
                <td><html:text name="DetalViewActionForm" property="do7" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Специфічні вимоги щодо живлення електроустановок замовника, які стосуються резервного живлення, допустимості паралельної роботи елементів електричної мережі:</td>
                <td><html:text name="DetalViewActionForm" property="do8" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Вимоги до кошторисної частини проекту:</td>
                <td><html:text name="DetalViewActionForm" property="do18" styleClass="dataobjects"/></td>
            </tr>
            <tr>
                <td>Вимоги до оформлення проектно-кошторисної документації:</td>
                <td><html:text name="DetalViewActionForm" property="do19" styleClass="dataobjects"/></td>
            </tr>

        </table>
    </body>
</html>
