<%--
  Created by IntelliJ IDEA.
  User: us9522
  Date: 17.01.2017
  Time: 9:42
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<p>Для коректного зберігання паролю в формі ТУ потрібно:</p>
1. Зайти в налаштування браузера.<br><br><br>
<img src="savePassImg/1.PNG"><br>
2.Прокрутити вниз, знайти та натиснути на посилання *додаткові налаштування*.<br><br><br>
<img src="savePassImg/2.PNG"><br>
3. Знайти посилання *КЕРУВАННЯ ПАРОЛЯМИ* за перейти за ним.<br><br><br>
<img src="savePassImg/3.PNG"><br>
4.У двох вікнах *ЗБЕРЕЖЕНІ ПАРОЛІ* та *НІКОЛИ НЕ ЗБЕРІГАЛОСЯ* знайти obl-java:8080 або 10.93.105.25:8080, якщо у якомусь з вікон є ці дві адреси, то видалити їх обох та видалити(натиснувши на хрестик, який з*явиться, коли курсор мишки буде на адресі) їх звідти.<br><br><br>
<img src="savePassImg/4.PNG"><br><br><br><br><br>
5.Перелогінитись в ТУ(Коли спитає зберегти пароль, натисніть кнопку зберегти)




